import { task } from "../components/task/task"


document.addEventListener("DOMContentLoaded", () => {
    if (!sessionStorage.getItem("kids")) {
        console.log(sessionStorage.getItem("kids"))
        const kids = [
            "Акулич Александра",
            "Алексеева Александра",
            "Бардиловский Мирослав",
            "Бондарчик Полина",
            "Бородкин Михаил",
            "Борозна Александра",
            "Бурак Денис",
            "Галимская Виктория",
            "Гончарова Ангелина",
            "Долинский Иван",
            "Заболотец Маргарита",
            "Зенченко Вера ",
            "Ивашкевич Алексей",
            "Казак Евгения",
            "Касперович Максим",
            "Кийков Андрей ",
            "Кононок Илья",
            "Кочеревская Карина",
            "Матюшонок Кирилл",
            "Мацукевич Виктория",
            "Мацукевич Евгения",
            "Метельская София",
            "Минаев Иван",
            "Новик Юлия",
            "Полугодков Тимофей",
            "Федосенко Никита",
            "Филиппов Егор",
            "Черник Лидия",
            "Шпаглов Матвей",
            "Ямшанова Ульяна",
        ]
        
        sessionStorage.setItem("kids", JSON.stringify(kids))
    }

    if (!sessionStorage.getItem("tasks")) {
        sessionStorage.setItem("tasks", JSON.stringify([]))
    }

    task()
})


